/*Найти сумму цифр целого положительного двузначного числа. Результат вывести в консоль.
*/
package lesson02;

public class task3 {
    public static void main(String[] args) {
        System.out.println("Дано двухзначное чило 87");
        int i=8, l=7;
        int result = i+l;
        System.out.println("Сумма цифр равна "+result);


    }
}
